/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   map_2_figures.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: caellis <caellis@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/06/06 15:08:15 by caellis           #+#    #+#             */
/*   Updated: 2019/06/13 15:01:07 by caellis          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "fillit.h"

t_tetris    *map_2_figures(char const *map, t_tetris **figures, char q)
{
	char		*s_fig;
	char		i;

	i = 'A';
	while (i < 'A' + q)
	{
		MALL_CHECK(s_fig = ft_strsub(map, 0, 20));	// вырезали фигуру, выделяя память
		map += 21;									// передвинули пойнтер на след. фигуру
		add_figure(figures, new_figure(s_fig, i));	// засунули в список, вставляя индекс
		i++;
	}
	// Теперь в фигурез у нас лежат отдельные кусочки, но пока не очень удобно
	return (*figures);
}